[
  {
    "title": "Hansel and Gretel",
    "text": "Once upon a time, a brother and sister named Hansel and Gretel lived in a hut in the woods with their father who was a poor woodcutter and their mother. Their parents were very poor and had barely enough food to eat One day, their parents sent them off into the woods in search of greener pastures. Their mother cried as she sent them off but they could not take care of them any longer. Hansel and Gretel took a few pebbles and some bread crumbs with them. That night the two children had nowhere to sleep. They wandered in the forest for days, looking for food and a place to stay. The children slept under a tree that night and kept each other warm. The next morning when the sun rose, Hansel turned to his little sister. “Gretel,” he said, “we cannot stay here.  We must go deeper into the woods!  Surely we will find more to eat than what we get at home and we can bring some food for mother and father” Gretel was worried. “But what if we get lost?” she asked “We won’t!” said Hansel.  “If we get lost, we will follow the pebbles back home.” As they went deeper and deeper into the forest, the children decided to drop pebbles on the path to help them find a way back home if they get lost. Soon, they had no more pebbles and all they had left were bread crumbs.  Gretel was careful to drop one crumb and then after a bit, another. There was no luck and the children had looked and looked for any sign of something to eat – an apple tree, pear tree, some nuts on the ground, or even dried-up berries.  There was nothing to eat!  They got hungrier and hungrier and the children were tired. They decided to go back home or they would starve. They turned back and all the bread crumbs were gone. Now they were lost! They did not know their way back home. “Oh, no!” cried Gretel “The birds ate up all the crumbs!” the children were sad. Gretel began to cry but Hansel assured her they will be safe. They walked on and suddenly, a wolf howled in the distance. They hurried away to avoid being eaten by the wolf. The sun was setting and the children were lost and hungry.  Now they were scared, too. Soon, they saw a strange house made up of cookies, candies, and chocolates. The children were immediately happy and ran along the path to the house. They knocked at the yummy chocolate door but nobody answered. They knocked again and the door opened. The children were too hungry to wait for the owner of the house. They went in and started to eat the yummy door. When they both were eating the yummy door, a witch pounced on them. The strange house belonged to a witch! The children begged for their lives but the evil witch did not listen. She locked up Hansel in a cage and asked Gretel to help her heat the oven. She would cook them and eat them up. But just as the witch bent to check the oven’s temperature, Gretel pushed her from behind and locked the oven door. Gretel rescued Hansel and they filled their pockets with the witch’s jewels and goodies. They ran as fast as they could through the forest without stopping. They were too scared to stop for the witch may catch up to them. Finally, they managed to find their way back home and gave jewels to their parents. Thanks to the clever children! The family was never poor and hungry again.",
    "summary": "Cast out by their parents, the starving brother and sister stumble on the edible house of an old woman. They don't know she's built the house specifically to lure children to their death. The old woman cages Hansel and forces Gretel to work as a servant, but in the end Gretel manages to kill the woman and free her brother. They return home with riches from the house in the woods to find their stepmother dead and their father overjoyed to see them."
  },
  {
    "title": "The Three Little Pigs",
    "text": "Once upon a time, there was a farmer with three little pigs. He did not have enough food to take care of his pigs so he sent them away to take care of themselves. The first little pig was walking on the road. Suddenly he saw a man with some straws. He could  build a house with the straws, he said to himself and asked the man to give him his straws. The man was kind so he gave the first little pig his straws. The pig used the straws to build a straw house and danced around. Suddenly, a big bad wolf knocked on the door. “Little pig, little pig, let me come in.” The big bad wolf said “No! Go away big bad wolf”, the little pig said “Then I’ll puff, and I’ll huff, and I’ll blow your house in.“, the big bad wolf said So he huffed, and puffed, and he blew the house down. The big bad wolf ate up the little pig. The second little pig saw a man with some mud. He coud build a house with the mud, he said to himself and asked the man to give him his mud. The man was also kind so he gave the second little pig his mud. The pig used the mud to build a mud house and danced around. Suddenly, a big bad wolf knocked on the door. “Little pig, little pig, let me come in.” The big bad wolf said “No! Go away big bad wolf”, the little pig said “Then I’ll puff, and I’ll huff, and I’ll blow your house in.“, the big bad wolf said So he huffed, and puffed, and huffed and puffed and huffed and puffed once more then he blew the house down. The big bad wolf ate up the second little pig. The third little pig saw a man with some red bricks. He could build a house with the red bricks, he said to himself and asked the man to give him his red bricks. The man was kind too so he gave the third little pig his straws. The pig used the straws to build a straw house and danced around. Suddenly, a big bad wolf knocked on the door. “Little pig, little pig, let me come in.” The big bad wolf said “No! Go away big bad wolf”, the little pig said “Then I’ll puff, and I’ll huff, and I’ll blow your house in.“, the big bad wolf said So he huffed, and puffed, and huffed and puffed, and huffed and puffed and huffed and puffed once more but he could not blow down the house. The red brick was very strong. The third little pig was very happy that the wolf could not blow down his house. The wolf was very angry. He had a new plan. He will trick the little pig so that it will step out of the house and he will eat the little pig. “Little pig, I know where there are nice apples” “Where?” asked the little pig. “They are in the fields up the hill. If you will, we will go together tomorrow and get some for dinner.” “Okay,” said the little pig, “I will be ready. What time are we going?”, asked the little pig. “At six o‘clock”, said the big bad wolf. The next day, the pig woke up very early and went to fetch the apples before the big bad wolf arrived. “Little pig, are you ready?”, the big bad wolf asked.  I have gone and come back, and got a nice potful for dinner.”, said the little pig. The wolf felt very angry at this. The little pig was very smart. He decided to climb up the chimney but the little pig was very smart indeed. He placed a big pot of boiling water at the bottom of the chimney. When the big bad wolf climbed down, he fell into the pot of boiling water. The little pig cheered. Now, the  big bad wolf was no more.",
    "summary": "Three pigs set out to build their own houses. One pig built a house of straw and the second a house of sticks because they were lazy. The third took the time to build a strong house with bricks. When the big bad wolf came, he huffed and puffed and blew the straw and stick houses down. He couldn't blow down the brick house, and the pigs put a pot of boiling water in the fireplace. The wolf fell into it and died."
  },
  {
    "title": "Red Riding Hood",
    "text": "Once upon a time, there was a little girl who lived with her mother very close to the woods. The little girl was called Little Red Riding Hood because of the red hat her grandmother gifted her. She liked this hat very much and wore it everywhere. Her mother told her not to talk to strangers and she did as told. Whenever she was sent on an errand, she would be careful not to talk to strangers. One day, her grandmother was very sick so her mother sent her to deliver a basket of fruits and medicine to her grandmother who lived deep in the woods so she could feel better. Her mother instructed her to stay on the path and keep away from strangers. Little Red Riding Hood hurried off into the woods, singing as she strolled to her grandmother’s house. On the way, a hungry bad wolf spotted Little Red Riding Hood and began to salivate. He had seen his lunch. Fairy Tale Picture Little Red Riding Hood Little Red Riding Hood, depositephotos.com He approached her and Little Red Riding Hood forget her mother’s instruction. The wolf asked where she was off to in such a hurry. I am going to my grandmother’s house in the woods. She is very ill and needs some fruits and medicine to feel better“, replied Little Red Riding Hood. The bad wolf grinned to himself. Now, he had two lunches. He would eat the little girl and her grandmother. Little Red Riding Hood did not know the bad wolf’s evil plan. The bad wolf told Little Red Riding Hood that she should take along some flowers for her grandmother too. He said the flowers will make her feel better too. The little girl was thrilled and ran off to fetch some flowers for granmother. The wolf hurried off and went to grandmother’s house. He pretended to be Little Red Riding Hood. He knocked on the door and waited for a response. “Who is at the door?“grandmother asked. “Grandmother, it is I, little red rding hood“, the wolf replied “Oh, dear. Come on in. Remove the latch and enter“, said grandmother. She did not know that it was the bad wolf. The bad wolf entered and went straight up to grandmother’s room. She was laying on her bed. The wolf pounced on her and ate her up. The bad wolf then wore grandmother’s clothes and pretended to be grandmother. He tucked himslef into grandmother’s bed and waited for Little Red Riding Hood. Soon after picking flowers, Little Red Riding Hood ran off to grandmother’s house. She saw the door opened and called out to grandmother but there was no response. She was worried for grandmother and hurriedly ran inside. “Grandmother!“, she called out repeatedly but there was no response still. When she reached grandmother’s room, she saw grandmother asleep on the bed. Grandmother looked very different. She had big ears, huge teeth, huge feet and hands and she was very big. She did not know that it was the bad wolf. Suddenly, the bad wolf jumpd out of bed and ate her up. The bad wolf was no longer hnugry. He decided to take a nap after a very satisfying lunch. Soon, a hunter passed by grandmother’s house. He knew grandmother very well and was surprised to see her door opened. “Grandmother“, he called out but there was no response. He entered and went up to grandmother’s room. He was surpeised to see the bad wolf he had been looking for in grandmother’s bed. He must have ate up grandmother, he thought. He opened up the bad wolf and found grandmother and Little Red Riding Hood in the wolf’s belly. The bad wolf was afraid and ran off.  Little Red Riding Hood gave grandmother her fruit and medicine and they were happy. No one knew what became of the bad wolf but no one heard about him again",
    "summary": "A red-cloaked little girl walks through the woods to take a basket of provisions to her grandmother. On the way, she meets a wolf who suggests that she also pick some flowers for the old woman. The wolf then heads for the grandmother's house and eats her up. He puts on the grandmother's nightclothes and climbs into her bed. Little Red Riding Hood is somehow fooled, and the wolf devours her as well. Grandmother and granddaughter are rescued by a passing huntsman."
  },
  {
    "title": "The Princess and the Pea",
    "text": "Once upon a time, in a kingdom far far away, there lived a handsome prince who wanted to marry a real princess. If only he knew a way to tell which princesses were real. The prince traveled all over the world to find a real princess but he did not find anyone he wanted. He found a lot of princesses, but it was difficult to find out if they were real ones. There was always something about them that seemed weird or absurd. Frustrated, the prince came home again and was sad, for he would have liked very much to have a real princess. One evening a terrible storm came on; there was thunder and lightning, and the rain poured down in torrents. Everyone had to stay indoors so the wind won’t carry them away or worse, they could drown in the heavy flood caused by the rain! Suddenly, someone knocked at the city gate, and everyone wondered who that could be. The guards at the city gate were reluctant to open it. “Who goes there?”, one of the guards asked. “I am a princess”, a girl replied and the guards were surprised. They wondered if she were truly a princess. The guards sent word to the old king about the princess’s arrival and he ordered them to open the city gates. It was indeed a princess standing out there in front of the gate. But, good gracious! The rain and the wind had made her look drenched and unpresentable. The water ran down from her hair and clothes; it ran down into the toes of her shoes and out again at the heels. And yet she said that she was a real princess. It was hard to believe she was a princess but she was led by the guards to the palace still. The prince was doubtful but he was stunned to see such a beautiful girl “We will know if she is a real princess soon enough” thought the old queen when the princess entered the palace. But she said nothing. She ordered  the maids to make a room for the priincess and off they went into the bed-room, took all the bedding off the bedstead, and when the room was ready,the old queen laid a pea on the bottom. She took twenty mattresses and laid them on the pea, and then twenty eider-down beds on top of the mattresses. On this the princess had to lie all night. At night, the princess could barely sleep. She was uncomfortable because of the pea. She rolled all over the bed and felt pain in her back. In the morning, at breakfast, the old queen asked how she had slept. “Oh, very badly!” said she. “I have scarcely closed my eyes all night. Heaven only knows what was in the bed, but I was lying on something hard, so that I am black and blue all over my body. It’s horrible!” “Goodness! She was indeed a princess” the old queen thought. Now they knew that she was a real princess because she had felt the pea right through the twenty mattresses and the twenty eider-down beds. Nobody but a real princess could be as sensitive as that. The prince was beaming with excitement. Now he had found himself a princess to marry. So the prince married her for now he knew that he had a real princess. It was a grand wedding and everyone in the kingdom was invited. The prince and the princess lived happily ever after and the pea was put in the museum, where it may still be seen, if no one has stolen it.",
    "summary": "A prince wanted to make sure he married a real princess. He devised a test for an unexpected guest who claimed she was a princess. He placed a pea beneath 20 mattresses and 20 feather beds, believing that only a princess could be sensitive enough to feel the small pea. The next morning, the princess said she did not sleep because of something hard in her bed. The two were married and lived happily ever after."
  },
  {
    "title": "Rapunzel",
    "text": "There once lived a carpenter and his wife who longed for a child. They prayed everyday for a child but they never had one. At the back of their house, there was a beautiful garden with beautiful flowers and plants. No one dared enter into the garden for it belonged to a witch, Mother Gothel. One day, the carpenter’s wife was sick and she craved some rampion from Mother Gothel’s garden. The carpener was worried for his wife and asked her “What shall i do for you, my dear wife?“ “Oh,” she answred, “I shall die unless I can have some of that rampion to eat that grows in the garden at the back of our house.”  The carpenetr loved his wife so he agreed to steal some rampion for her. That night, he climbed over the wall into the garden and plucked a handful of rampion  and brought it to his wife. His wife made a salad and ate  it but she liked it so much. She wanted more. The carpenter climbed into Mother Gothel’s garden againb that night, but this time, the witch was waiting for him. She noticed some of her rampion was missing the day before and wanted to catch the thief. “How dare you climb over into my garden like a thief, and steal my rampion! I will place a curse upon you!“ the witch threatned. “Oh, please be merciful. my wife saw your delicious rampion and wanted some of it.” The man pleaded. Then the witch said, “You can have as much rampion as you  want but only on one condition. Your wife will have a baby and the baby must be given to me. I will care for it like a mother“. The man was unhappy but because he was afraid, he agreed. When the time came when the child was born, the witch appeared. She took the child from them and called the child Rapunzel. It was a baby girl. The witch took the baby away with her. As Rapunzel grew, she was the most beautiful child in the world. When she was twelve years old, the witch locked her up in a tower deep in the forest. This tower had no steps nor doors, only a small window above. Whenever the witch went out or came in, she would say, “Rapunzel, Rapunzel! Let down your hair!” Rapunzel had beautiful long golden hair and whenever the with called out, she would let down her hair for the witch to climb. One day, the King’s son was riding through the forest and heard a sweet voice singing. He was astonished and wanted to know who the mysterious singer was. It was Rapunzel. She sat by her window, singing. The King’s son wanted to meet her, and searched for door into the tower, but there was none. So he went home sad. Another day came and as he was listening to Rapunzel sing, he saw the witch arrive and heard her say: “O Rapunzel, Rapunzel! Let down your hair.” Then he saw how Rapunzel let down her long hair, and how the witch climbed up. The prince was happy and the next day he went to the tower and cried, “O Rapunzel, Rapunzel! Let down your hair.” And she let down her hair, and the King’s son climbed up the tower. Rapunzel was afrarid because she had never seen a man before. The prince spoke to her kindly and asked her to marry him. Rapunzel was hesitant but since she didn’t like Mother Gother very much, she agreed to marry him. The prince was happy but there was no way for Rapunzel to climb out of the tower since there was no door. The prince promised to bring a long rope the next evening and she would climb out of the tower and he would take her away on his horse.  The next day, when the witch was away, the prince came with a long rope as promised. He called out “Rapunzel, Rapunzel! Let down your hair.” Then she let the hair down, and the King’s son climbed up. He fastened the rope to the window and made a knot so that the rope would hold them as they climbed down. Rapunzel and the prince then climbed out of the tower before the with returned. He took her to his kingdom and they lived happily ever after.",
    "summary": "As punishment for stealing from her garden, an enchantress seizes a couple's newborn baby daughter, Rapunzel, and raises her as her own. When the girl turns 12, the witch imprisons her at the top of a doorless tower and uses Rapunzel's long hair as a ladder to go up and down from her chamber. One day a prince catches sight of the enchantress climbing the tower. He tries the same thing, and the two young people fall in love. But when Rapunzel inadvertently tells the enchantress about him, she and the prince are banished to the wilderness. They're happily reunited—the prince with Rapunzel and their twin children—several years later."
  },
  {
    "title": "The Little Mermaid",
    "text": "Once upon a time, far out in the deep ocean where the water is very clear and blue, a sea king ruled the undersea world and the sea folk. The undersea world had beautiful trees and colorful flowers. There were beautiful sea creatures and all sorts of fish too. The sea folk lived in harmony. The sea king, King Triton lived in his sea castle with his mother and his four daughters. The castle walls were made of blue coral and the roof shells opened whenever the water passed by. The little princesses were very beautiful but the most beautiful one of them all was the youngest princess. Her name was Ariel and she was the little mermaid. Her skin was soft and her eyes were as blue as the deep sea. She had no feet as she was a mermaid. Instead of legs, she had a beautiful fish tail. Ariel liked to play a lot. She used to play in the palace, down in the great halls all day long. One day while she was playing outside the place in the big, colorful garden, a small sculpture of a handsome boy sank down the bottom of a sunken ship. While playing, Ariel found it. She is curious to know who this boy is so she swims to the ships that had fallen to the bottom of the sea. The little mermaid found a lot treasures from the world on land. She saw all kinds of things like silver forks and mirrors and golden combs. The little mermaid started to keep all these treasures and made a collection in her treasure box. Every day, she grew more curious to know more about the surface. She wanted to swim to the surface but her father would not allow her or any of her sisters to swim up to the surface until they were fifteen. This was a long time for the little mermaid as she was the youngest! So she asked her grandmother to tell her tales about the surface and she would day dream. Soon all her sisters turned 15 and they were allowed to swim to the surface. Whenever they returned, they would tell the little mermaid about the wonders and beauties of the surface and the humans! When it was the little mermaid’s turn to swim to the surface, she was very eager and excited. She swam to the surface and found a ship swimming above her. She hurried to see the ship but the crew was in trouble. There was strong rainstorm and the ship was about to sink! The ship dipped and swooped and rolled side to side. The little mermaid did not know what to do. She could see a very handsome young man trying to help everyone on the ship. The man was working hard to keep the ship afloat. She did not know he was a prince. Suddenly, the ship started to tip over and the young prince fell into the sea! The little mermaid dove deep and fast and grabbed the prince. She swam to the surface as fast as she could because she knew humans could not live under water. She placed on dry sand on the shore and admired him. Suddenly, the young prince coughed and woke up. The little mermaid immediately hid behind a rock. He must not see her- a mermaid! The prince would never know that she saved him. The little mermaid became sad and swam back to home. Her sisters asked about her adventure but she was too sad to say anything. If only she were human. The next day, Ariel swam to the surface and saw the prince strolling around with his dog. She immediately hid and swam back to the ocean. She had fallen in love with the prince. The sea witch Ursula saw her and asked why she was sad. Ariel wanted to be human so she could marry the prince. Ursula told Ariel that she would make her human if only Ariel would give her voice in exchange. She told her Ariel would become her slave if the prince didn’t fall in love with her in three days. Ariel agreed without thinking. After turning her to a human, Ursula’s eels carried her to the surface and swam back to the ocean. The next three days, Ariel was with the prince but it was difficult to express her feelings because she could not talk but as they spent time together, the prince was getting fond of her.  On the second day, the prince took her out for a ride on his boat and they almost kissed. This made Ursula very angry because the prince was falling in love with her. That night, Ursula transformed into a beautiful human and cast a spell on the prince and caused him to fall in love with her. The following day, the prince made arrangements to marry Ursula and Ariel was sad. She did not know what to do or who the strange human was. Just then, her sea gull friend watches as Ursula sings to herself. He flies off and comes to tell Ariel that the woman is Ursula and she doesn’t want the prince to marry Ariel. Ariel quickly picks herself up and crashes the prince’s wedding on his ship. She breaks Ursula’s magic necklace and she transforms into her real self. The spell is broken and the prince remembers Ariel. Her voice returns to her and she speaks for the first time. Ursula is defeated and returns to the sea while Ariel marries the prince. Her father casts another spell that allows Ariel to transform to a mermaid whenever she wanted and she lived happily ever after with the prince. ",
    "summary": ""
  },
  {
    "title": "Goldilocks and the Three Bears",
    "text": "Once upon a time there were three bears. The bears lived together  in the woods. The Little Wee Bear was Baby Bear, the Middle-sized Bear  was  Mama Bear, and the Great Big Bear was Papa Bear. Their house had furniture and cutleries  the size of each bear. Baby bear’s bowl, spoon, chair and bed were very little. Mama bear‘s bowl, spoon, chair and bed were all medium-sized. Papa bear’s bowl, spoon, chair and bed were very big.   One day, the three bears wanted to make porridge for breakfast.  After they had made the porridge for their breakfast, and poured it into their porridge-bowls, it was too hot for them to eat. Baby bear cried because he had hurt his tongue so Papa bear and Mama bear decided that they all go for a walk in the woods and come back when the porridge is warmer and perfect to eat. While they were awa,  a little girl called Goldilocks, who lived at the other side of the woods passed by their house. Goldilocks  had been sent on an errand by her mother so she passed by the house, and looked in at the window. When she peeped in at the keyhole, she saw the porridge on the table. Goldilocks felt hur tummy rumble and decided to knock. When she knocked and no one answered, Goldilocks opened the door and went in. Goldlocks was an ill-mannered little girl so instead of waiting for the three bears, she set about helping herself with the porridge. She tasted the porridge of Papa bear but it was too hot for her. Next she tasted the porridge of Mama bear, but that was too cold for her. Then she tasted Baby bear’s porridge and it was neither too hot nor too cold. Baby bear’s porridge wa just right, and she liked it so well that she ate it all up, every bit! After eating, Goldilocks was tired and wanted to sleep. She sat down on Papa bear’schair but it was too hard for her. She sat down in Mama bear’s chair, but it was too soft for her. But when she sat down in baby bear’s chair, it was neither too hard nor too soft, but just right. So she sat in it but it broke into tiny pieces.   Next, Goldilocks went upstairs into the bedchamber in which the Three Bears slept. And first she lay down onPapa bear’s bed , but it was too high for her.  She laid down upon baby bear’s bed but it was too low for her her. But when she laid down on Mama bear’s bed, it was neither too high at the head nor at the foot, but just right. Soon, Goldilocks fell fast asleep. While she was asleep, the three bears returned from thier stroll and found their door open. They were frightened and carefully walked inside. Somone had eaten from their porridges and eaten all of baby bear’s porridge! They went to the living room and someone had sat on all thier chairs and broken baby bear’s chair! They were starting to become more frightened. Then they went to their rooms and someone had slept on all their beds. Now, Papa bear was very angry. Baby bear saw a little girl sleeping on his bed. He screamed in fear but his voice was so sharp, and so shrill, that it awakened Goldilocks at once. She tumbled out of baby bear’s bed and ran to the window. So the naughty, frightened little Goldilocks jumped; and whether she broke her neck in the fall, or ran into the woods and was lost there, or found her way out of the wood and got whipped for being a bad girl and playing truant, no one could say. But the Three Bears never saw anything more of her.",
    "summary": "Goldilocks saw a cabin in the woods and entered. There, she found three bowls of porridge. One was too cold, one too hot and the other just right, so she ate that one. Goldilocks then found three chairs, one too hard, one too soft, and the little one was just right and she sat in it and broke it. Of the three beds, one was too hard, one too soft and one just right, so she fell asleep. The bears came home and frightened her and she ran away."
  },
  {
    "title": "Rumpelstiltskin",
    "text": "Once, in a far away land, there lived a poor miller who wanted to be rich. The poor miller lied to the king that his daughter could turn straws into gold. The king was amazed but he did not believe the words of the poor miller. The king wanted to see for himself so he sent his guards to bring the miller’s daughter to the big castle and lock her up in a room full of straws. They gave her a wheel and spindle and locked her up. The king promised to release her if she could turn all the straws into gold. The miller’s daughter cried and pleaded. She did not know how to turn straws into gold. Suddenly, a friendly little man appeared and promised to help her. The little man was an imp. He knew how to spin gold out of the straws but he offered to help her in exchange for golden necklace. She agreed and gave him her necklace. It was a small price to pay, she thought. The little man set to work and began to spin the straws. To her surprise, they turned into gold and she was very happy. The next morning, the imp had disappeared. The king was astonished to find that the straws have turned into gold. He was very pleased and happy because the miller’s daughter could make him rich. Again, he ordered her to be moved into a bigger room with more straws and promised that he would marry her if she could turn the straws to gold one more time. The miller’s daughter was taken to a bigger room filled with more straws. That night, the imp appeared again and promised to spin the straw into gold in exchange for the ring on her finger. The miller’s daughter agreed and gave him her ring. I was a small price to pay too.  So the little man took the ring, and began to spin the wheel. By the next morning, all the straw was spun into glistening gold. The king marveled and amazed beyond measure at the sight of the gold, but he could never have enough of gold. Again, he ordered his men to lock her up in the biggest room in the castle and fill it with much more straws than before. If she could spin them all in one night, he would marry her immediately. That night, the imp appeared again and promised to help her but she did not have anything else to give the imp. The imp was angry and she pleaded. The imp thought for a while and said “You must promise me the first child you have after you are queen” The miller’s daughter had no choice so she promised the little man what he desired, and he began to spin, until all the straw was gold. He soon disappeared after all the straw had turned to gold.  The next morning, the king was yet again astonished and very happy. He kept to his promise and married the miller’s daughter. The miller was now a rich man like he desired. Soon after, the queen gave birth to a beautiful baby. She had forgotten her promise to the imp. When the imp came to take the baby, she refused and begged the imp not to take her baby. The imp was angry but decided to have pity upon her. “I will give you three days to tell me my name. If not, you must give up the child to me.” the imp said and disappeared. The queen was very worried. She came up with a list of all the names in the kingdom. When the imp came on the second day, she called out all the names she had ever heard but none of them were correct. As the imp left, the queen ordered her messenger to follow him. She wanted him to spy on the imp and learn his name. As the imp left, he sang to himself “Today do I bake, tomorrow I brew, The day after that the queen’s child comes in; And oh! I am glad that nobody knew That the name I am called is Rumpelstiltskin!” The queen was very happy to hear the news. She gave her messenger a pat on the back and rewarded him with gold. The next day when the imp came, the queen asked “Are you called Peter?” “No,” answered the imp. “Then perhaps your name is Rumpelstiltskin?” replied the queen and the imp became very angry because the queen had learned his name. He stamped his right foot so hard in anger that he fell into a hole and that was the end of the imp.",
    "summary": "A poor miller lies to the king, saying his daughter can spin straw into gold. The king summons the daughter to his palace and sets her the task of spinning three roomfuls of straw into gold. A gnome accomplishes the task for her and asks for her first-born child in return. The miller's daughter and the king are married. When their first child is born, the new queen is loath to turn him over to the gnome, who relents and says he won't take the child if the queen guesses his name within three days. Thanks to a servant, the queen learns the gnome's name. When he hears her speak it, he tears himself in two."
  },
  {
    "title": "Jack and the Beanstalk",
    "text": "There was once upon a time a poor widow who had an only son named Jack, and a cow named Milky-white. And all they had to live on was the milk the cow gave every morning, which they carried to the market and sold. But one morning Milky-white gave no milk, and they didn’t know what to do. “What shall we do, what shall we do?” said the widow, wringing her hands. “Cheer up, mother, I’ll go and get work somewhere,” said Jack. “We’ve tried that before, and nobody would take you,” said his mother; “we must sell Milky-white and with the money start shop, or something.” “All right, mother,” says Jack; “it’s market-day today, and I’ll soon sell Milky-white, and then we’ll see what we can do.” So he took the cow’s halter in his hand, and off he started. He hadn’t gone far when he met a funny, looking old man, who said to him: “Good morning, Jack.” “Good morning to you,” said Jack, and wondered how he knew his name. “Well, Jack, and where are you off to?” said the man. “I’m going to market to sell our cow here.” “Oh, you look the proper sort of chap to sell cows,” said the man; “I wonder if you know how many beans make five.” “Two in each hand and one in your mouth,” says Jack, as sharp as a needle. “Right you are,” says the man, “and here they are, the very beans themselves,” he went on, pulling out of his pocket a number of strange-looking beans. “As you are so sharp,” says he, “I don’t mind doing a swop with you—your cow for these beans.” “Go along,” says Jack; “wouldn’t you like it?” “Ah! you don’t know what these beans are,” said the man; “if you plant them over-night, by morning they grow right up to the sky.” “Really?” said Jack; “you don’t say so.” “Yes, that is so, and if it doesn’t turn out to be true you can have your cow back.” “Right,” says Jack, and hands him over Milky-white’s halter and pockets the beans. Back goes Jack home, and as he hadn’t gone very far it wasn’t dusk by the time he got to his door. “Back already, Jack?” said his mother; “I see you haven’t got Milky-white, so you’ve sold her, How much did you get for her?” “You’ll never guess, mother,” says Jack. “No, you don’t say so. Good boy! Five pounds, ten, fifteen, no, it can’t be twenty.” “I told you you couldn’t guess. What do you say to these beans; they’re magical, plant them overnight and——” “What!” says Jack’s mother, “have you been such a fool, such a dolt, such an idiot, as to give away my Milky-white, the best milker in the parish, and prime beef to boot, for a set of paltry beans? Take that! Take that! Take that! And as for your precious beans here they go out of the window. And now off with you to bed. Not a sup shall you drink, and not a bit shall you swallow this very night.” So Jack went upstairs to his little room in the attic, and sad and sorry he was, to be sure, as much for his mother’s sake, as for the loss of his supper. At last he dropped off to sleep. When he woke up, the room looked so funny. The sun was shining into part of it, and yet all the rest was quite dark and shady. So Jack jumped up and dressed himself and went to the window. And what do you think he saw? Why, the beans his mother had thrown out of the window into the garden, had sprung up into a big beanstalk which went up and up and up till it reached the sky. So the man spoke truth after all. The beanstalk grew up quite close past Jack’s window, so all he had to do was to open it and give a jump on to the beanstalk which ran up just like a big ladder. So Jack climbed, and he climbed and he climbed and he climbed and he climbed and he climbed and he climbed till at last he reached the sky. And when he got there he found a long broad road going as straight as a dart. So he walked along and he walked along and he walked along till he came to a great big tall house, and on the doorstep there was a great big tall woman. “Good morning, mum,” says Jack, quite polite-like. “Could you be so kind as to give me some breakfast?” For he hadn’t had anything to eat you know, the night before and was as hungry as a hunter “It’s breakfast you want, is it?” says the great big tall woman, “it’s breakfast you’ll be if you don’t move off from here. My man is an ogre and there’s nothing he likes better than boys broiled on toast. You’d better be moving on or he’ll soon be coming.” “Oh! please mum, do give me something to eat, mum. I’ve had nothing to eat since yesterday morning, really and truly, mum,” says Jack, “I may as well be broiled as die of hunger.” Well, the ogre’s wife was not half so bad after all. So she took Jack into the kitchen, and gave him a junk of bread and cheese and a jug of milk. But Jack hadn’t half finished these when thump! thump! thump! the whole house began to tremble with the noise of some one coming. “Goodness gracious me! It’s my old man,” said the ogre’s wife, “what on earth shall I do? Come along quick and jump in here.” And she bundled Jack into the oven just as the ogre came in. He was a big one, to be sure. At his belt he had three calves strung up by the heels, and he unhooked them and threw them down on the table and said: “Here, wife, broil me a couple of these for breakfast. Ah! What’s this I smell? Fee-fi-fo-fum, I smell the blood of an Englishman, Be he alive, or be he dead I’ll have his bones to grind my bread.” “Nonsense, dear,” said his wife, “you’re dreaming. Or perhaps you smell the scraps of that little boy you liked so much for yesterday’s dinner. Here, you go and have a wash and tidy up, and by the time you come back your breakfast’ll be ready for you.” So off the ogre went, and Jack was just going to jump out of the oven and run away when the woman told him not. “Wait till he’s asleep,” says she; “he always has a doze after breakfast.” Well, the ogre had his breakfast, and after that he goes to a big chest and takes out of it a couple of bags of gold, and down he sits and counts till at last his head began to nod and he began to snore till the whole house shook again. Then Jack crept out on tiptoe from his oven, and as he was passing the ogre he took one of the bags of gold under his arm, and off he pelters till he came to the beanstalk, and then he threw down the bag of gold, which of course fell into his mother’s garden, and then he climbed down and climbed down till at last he got home and told his mother and showed her the gold and said: “Well, mother, wasn’t I right about the beans? They are really magical, you see.” So they lived on the bag of gold for some time, but at last they came to the end of it, and Jack made up his mind to try his luck once more up at the top of the beanstalk. So one fine morning he rose up early, and got on to the beanstalk, and he climbed and he climbed and he climbed and he climbed and he climbed and he climbed till at last he came out on to the road again and up to the great big tall house he had been to before. There, sure enough, was the great big tall woman a-standing on the doorstep. “Good morning, mum,” says Jack, as bold as brass, “could you be so good as to give me something to eat?” “Go away, my boy,” said the big tall woman, “or else my man will eat you up for breakfast. But aren’t you the youngster who came here once before? Do you know, that very day, my man missed one of his bags of gold.” “That’s strange, mum,” said Jack, “I dare say I could tell you something about that, but I’m so hungry I can’t speak till I’ve had something to eat.” Well the big tall woman was so curious that she took him in and gave him something to eat. But he had scarcely begun munching it as slowly as he could when thump! thump! thump! they heard the giant’s footstep, and his wife hid Jack away in the oven. All happened as it did before. In came the ogre as he did before, said: “Fee-fi-fo-fum,” and had his breakfast off three broiled oxen. Then he said: “Wife, bring me the hen that lays the golden eggs.” So she brought it, and the ogre said: “Lay,” and it laid an egg all of gold. And then the ogre began to nod his head, and to snore till the house shook. Then Jack crept out of the oven on tiptoe and caught hold of the golden hen, and was off before you could say “Jack Robinson.” But this time the hen gave a cackle which woke the ogre, and just as Jack got out of the house he heard him calling: “Wife, wife, what have you done with my golden hen?” And the wife said: “Why, my dear?” But that was all Jack heard, for he rushed off to the beanstalk and climbed down like a house on fire. And when he got home he showed his mother the wonderful hen, and said “Lay” to it; and it laid a golden egg every time he said “Lay.” Well, Jack was not content, and it wasn’t very long before he determined to have another try at his luck up there at the top of the beanstalk. So one fine morning, he rose up early, and got on to the beanstalk, and he climbed and he climbed and he climbed and he climbed till he got to the top. But this time he knew better than to go straight to the ogre’s house. And when he got near it, he waited behind a bush till he saw the ogre’s wife come out with a pail to get some water, and then he crept into the house and got into the copper. He hadn’t been there long when he heard thump! thump! thump! as before, and in come the ogre and his wife. “Fee-fi-fo-fum, I smell the blood of an Englishman,” cried out the ogre. “I smell him, wife, I smell him.” “Do you, my dearie?” says the ogre’s wife. Then, if it’s that little rogue that stole your gold And the hen that laid the golden eggs he’s sure to have got into the oven.” And they both rushed to the oven. But Jack wasn’t there, luckily, and the ogre’s wife said: “There you are again with your fee-fi-fo-fum. Why of course it’s the boy you caught last night that I’ve just broiled for your breakfast. How forgetful I am, and how careless you are not to know the difference between live and dead after all these years.” So the ogre sat down to the breakfast and ate it, but every now and then he would mutter: “Well, I could have sworn——” and he’d get up and search the larder and the cupboards and everything, only, luckily, he didn’t think of the copper. After breakfast was over, the ogre called out “Wife, wife, bring me my golden harp.” So she brought it and put it on the table before him. Then he said: “Sing!” and the golden harp sang most beautifully. And it went on singing till the ogre fell asleep, and commenced to snore like thunder. Then Jack lifted up the copper-lid very quietly and got down like a mouse and crept on hands and knees till he came to the table, when up he crawled, caught hold of the golden harp and dashed with it towards the door. But the harp called out quite loud: “Master! Master!” and the ogre woke up just in time to see Jack running off with his harp. Jack ran as fast as he could, and the ogre came rushing after, and would soon have caught him only Jack had a start and dodged him a bit and knew where he was going. When he got to the beanstalk the ogre was not more than twenty yards away when suddenly he saw Jack disappear like, and when he came to the end of the road he saw Jack underneath climbing down for dear life. Well, the ogre didn’t like trusting himself to such a ladder, and he stood and waited, so Jack got another start. But just then the harp cried out: “Master! Master!” and the ogre swung himself down on to the beanstalk, which shook with his weight. Down climbs Jack, and after him climbed the ogre. By this time Jack had climbed down and climbed down and climbed down till he was very nearly home. So he called out: “Mother! Mother! bring me an axe, bring me an axe.” And his mother came rushing out with the axe in her hand, but when she came to the beanstalk she stood stock still with fright for there she saw the ogre with his legs just through the clouds. But Jack jumped down and got hold of the axe and gave a chop at the beanstalk which cut it half in two. The ogre felt the beanstalk shake and quiver so he stopped to see what was the matter. Then Jack gave another chop with the axe, and the beanstalk was cut in two and began to topple over. Then the ogre fell down and broke his crown, and the beanstalk came toppling after. Then Jack showed his mother his golden harp, and what with showing that and selling the golden eggs Jack and his mother became very rich, and he married a great princess, and they lived happy ever after.",
    "summary": "Jack took the family cow to sell and traded it for magic beans. His mother was angry and threw the beans out of the window. The next morning a giant beanstalk had grown. Jack climbed the beanstalk and found a giant there who had gold coins. Jack stole them and took them home. Later, Jack returned and saw a hen that laid golden eggs and he stole that, too. The third time he tried to steal a magic harp and the harp cried out. The giant chased Jack down the beanstalk, but Jack chopped it down and the giant fell."
  },
  {
    "title": "Cinderella",
    "text": "There was once a rich man whose wife was very sick. One day, she called her only daughter to come near her bed, and said, “Dear child, be of good character and God will always take care of you, and I will look down upon you from heaven, and will be with you.”  And then she closed her eyes and died. The girl did as her mother told her and we His new wife was the meanest and proudest woman that was ever seen nt every day to her mother’s grave and wept. Soon, her father married a new wife. His new wife was the meanest and proudest woman that was ever seen. The new wife brought two daughters home with her, and they were beautiful and fair in appearance, but cruel and proud like their mother. The young maiden’s step sisters often maltreated her . In the evenings,  the young maiden had to rest on the hearth among the cinders because she didnt have any bed to sleep on unlike her step sisters.  The young maiden always looked dusty and dirty so they named her Cinderella. One day, a message came from the king inviting every eligible lady in the land for a ball so that the prince could choose  a bride from among the ladies. When Cinderella’s step sisters heard,  they started to order her around and said, “Comb our hair, brush our shoes, and make our buckles fast“ Cinderella wished she could go to the ball too but she didnt have any clothes. “No, Cinderella, you have no proper clothes, and you do not know how to dance, and you would be laughed at!” her step sisters. Soon, they were all dressed up and left for the ball but and as there was no one left in the house, Cinderella went to her mother’s grave, under the hazel bush, and cried,  “Little tree, little tree, shake over me, That silver and gold may come down and cover me.” Just then, a bird flew over and cast down a beautiful dress. Cinderella was astonished. The dress was so beautiful, she couldn‘t help but admire it. She wore a dress and a magical carriage came and took her to the ball. When the prince saw her, he was struck by her beauty and wanted to know where she lived but Cinderella ran to the hazel bush and hid. The prince searched for her but he could not find her.  When she got home, Cinderella took off the dress and had laid it on her mother’s grave, and the bird carried it away. She then went to back to sit in the kitchen among the cinders. The next day, after her step-sisters and step mother had gone to the ball Cinderella went to the hazel bush and called out to the bird again. Then the bird cast down a still more splendid dress thanthe one she wore the previous day. nd when when she went to the ball, every one was astonished at her beauty. The prince had been waiting for her. When he saw her, he was excited. He took her hand and danced with her alone. When it was midnight, Cinderella rushed off into the hazel bush again and the prince searched for her in vain. He wanted to know where she lived. On the third day, Cinderella went to the grave and repeated the same thing. The bird cast down a more beautiful dress and gold slippers. At the ball, everyone was once again astonished by Cinderella. When it was almost midnight,  Cinderella wanted to go home but the prince had a plan. The prince had caused all the steps to be spread with pitch. As cinderella ran off, her golden slippers got stuck and she had to leave it behind. The prince then picked it up, and saw that it was very small and slender. The next morning, the prince ordered  his men to find the maiden whose foot the golden shoe should fit. The two sisters tried on the glass slippers but it did not fit them because their feet were bigger than Cinderella’s feet. The king’s son then asked if the sisters had another sister but the mother said, “Oh no! she is much too dirty, I could not let her be seen.” But the prince insisted that cinderella be shown to him. After Cinderlla had cleaned herslef, she curtseyed to the prince and slipped  her feet into the golden slippers. It fitted her perfectly. When Cinderella stood up,  the prince recognized cinderella. She was indeed the beautiful maiden that had danced with him. He cried, “This is the right bride!” The step-mother and the two sisters were thunderstruck and furious. The prince put Cinderella on his horse and rode off. The prince married her and they lived happily ever after.",
    "summary": "Cinderella grew up with an evil stepmother and stepsisters. They would not let her go to the prince's ball, but her fairy godmother made it happen with magic. Cinderella danced with the prince and they fell in love. Since she had to leave by midnight, she ran and lost one slipper. The prince found the slipper and searched for her. After he found her, they were married and lived happily ever after."
  },
  {
    "title": "Snow White and The Seven Dwarfs",
    "text": "Once upon a time, long, long ago a king ruled over a distant land. He lived with his daughter, the princess and her stepmother, the queen. The little princess was called Snow White because her skin was as white as snow. Her lips were red as blood, and her hair was black as ebony. Her stepmother was beautiful, but she was proud and cruel.  She owned a magic mirror, and everyday she would daily ask, Mirror, mirror on the wall, who’s the fairest of them all? And every time she asked, the mirror would give the same answer, “Thou, O Queen, art the fairest of all.”  This made the queen very happy because she knew that her magical mirror does not lie. One morning when the queen asked, “Mirror, mirror on the wall, who’s the fairest of them all?” she was shocked when it answered: “You, my queen, are fair; it is true. But Snow White is even fairer than you” The Queen became jealous and angry. She  ordered her huntsman to hurt Snow White but The poor huntsman was unable to hurt the girl. The huntsman took her to the great forest instead and let her go. He told her to run away and never return. Snow White ran and ran,never to be seen again. The huntsman lied to the Queen that Snow White had run away and she was happy. Snow White was all alone in the great forest, and she did not know what to do.  The forest frightened her and she began to run. She ran as far as her feet could carry her until she saw a little house and went inside in order to rest. Inside the house everything was small but tidy. Snow White was hungry so she ate a few vegetables and a little bread from each little plate and drank a little bit  milk from each cup. Later, Snow White was so tired, so she lay down on one of the little beds and fell fast asleep. That night, the owners of the house returned home.  They were the seven dwarves who mined for gold in the mountains. They came home feeling merry but they saw that someone had been in their house. They went to their bedroom and found Snow White lying there asleep.  The seven dwarves were so happy that they did not wake her up, but let her continue to sleep in the bed “Oh good heaven! ” they cried. “This child is beautiful!” The next morning Snow White woke up, and when she saw the seven dwarves she was frightened.  But they were friendly. “What is your name?” They chorused. “My name is Snow White,” she answered. “How did you find your way to our house?” the dwarves asked further. Then she told them that her stepmother had tried to hurt her butt the huntsman told her to run away and that she had run through the forest, finally stumbling upon their house. The dwarves looked at her closely and spoke with each other for a while and then said, “If you will keep the house for us, and cook, make beds, wash, sew, and knit, and keep everything clean and orderly, then you can stay with us, and you shall have everything that you want.” “Yes,” said Snow White, “with all my heart.”  Snow White greatly enjoyed keeping a tidy home. They all cheered and Snow White lived happily with the dwarves.  She had completely forgotten about her stepmother, the evil queen and she was grateful for the huntsman who saved her life. The dwarves were her new family.",
    "summary": "Snow White's evil stepmother wanted to be the fairest in the land and was jealous of Snow White's beauty. The stepmother ordered a huntsman to kill Snow White, but the huntsman spared her life. Snow White came upon a cottage that belonged to seven dwarfs, who let her stay. Soon the wicked stepmother found her, disguised herself and took her a poison apple. Snow White fell into a deep sleep, and the dwarfs made a crystal coffin for her. Prince Charming came by the cottage, saw her, kissed her, and she awoke. They were married and lived happily ever after."
  },
  {
    "title": "The Ugly Duckling",
    "text": "Once upon a time, there was a duck. She lived in the forest. One day she laid some eggs. There was one very big egg among the eggs she laid. After warming the eggs carefully, the duck waited for the eggs to hatch. As she watched, three of her eggs cracked and three beautiful ducklings hatched. The mother duck was overjoyed but the largest egg was still there. At last the great egg burst but it was large, grey, and ugly. The mother duck looked at it. “Oh no! He can’t be my baby” she cried out. It was a strange looking duck. “How ugly and different he is from all my other children”, mother duck said. The ugly duckling was disliked by his brothers and sisters. They would often make fun of him. They wouldn’t swim in the pond with him and they never shared anything with him. The ugly duckling felt so sad that ran away from home one day. While walking alone, the ugly duckling came across a house. He was curious to see who lived there so he went inside. Perhaps, he would find someone who liked him. As he peeped inside, he saw an old woman sitting idle. At her foot sat a cat and a hen. Suddenly, the woman noticed the duckling. At first, the woman cuddled the duckling but the very next moment she screamed at him in anger. “Away from here, you ugly duckling”, she said. The duckling was immediately terrified and ran out of the house. Once again, the poor duckling went walking sadly. He spent the rest of his day and night crying all alone. He felt lonely and miserable but the ugly duckling was hopeful in his heart that someone would like him. He kept on walking and walking. Then, one day, the duckling saw a pond. His eyes lit up in joy as he hadn’t seen water for so many days. The ugly duckling hopped into the water with joy. He swam to his satisfaction. But his happiness was short-lived. The water was suddenly becoming colder and colder. Winter had started and the cold wind had started to blow. Due to the cold weather, the pond had frozen. The ugly duckling couldn’t swim anymore. A little while later, a kind farmer happened to pass that way. The kind farmer saw the ugly duckling sitting all alone. “What a strange looking bird”, the man thought to himself. “I shall look after you” he said. He felt pity for the duckling’s miserable condition and took him home. The farmer took care of the duckling and soon the bird was well. Then the farmer left the duckling in the pond. One morning, while the duckling was swimming in the pond, he saw beautiful swans around him. The duckling was ashamed of himself because he looked ugly and bent his head low but he saw something strange beneath. He saw his own reflection and it was the reflection of a swan! He was no longer a grey, ugly bird. The duckling was amazed. He wondered if he were a swan too. The bird had grown into a beautiful swan and those beautiful swans he saw were his brothers and sisters. The mother swan saw him and cried out “What a beautiful looking swan!” The mother swan swam to the ugly duckling and her baby swans followed. They were astonished by his beauty. The ugly duckling remembered how everyone used to ignore him. The ugly duckling now heard the swans say that he was the most beautiful among them. Now he was no more the ugly duckling. He lived with his new family and they lived happily ever after.",
    "summary": "One duckling did not look like his brothers and sisters, and he was sad. He decided to run away. When he came across a cottage, he stayed there for a while but the children scared him. The duckling left and spent the winter in the pond. In the spring, he saw his reflection and realized he was a swan."
  },
  {
    "title": "The Emperors' New Suit",
    "text": "Many years ago, there lived an emperor who cared too much about his looks. He liked to wear the most fancy suits and parade around his kingdom. He had a new coat for evry hour of the day and often liked to show off his outfits. He did not care much for the kingdom and the people were not happy with their emperor. One day, two crooks came to the city and lied that they were weavers. They told the people that they could manufcature the finest cloth they could ever imgaine. They said the cloth was magical and that the cloth could only be seen only the clever and those fit for their places. The dress was so special that no ordinary man could see it. The people of the city were amazed and astonished by the words of the weavres. Soon, the emperor heard of the weavres and invited them to his castle. “If I were to be dressed in this special suit, I will know which men in my empire are unfit for their places, and I would be able to know the clever and the stupid. I must have this cloth woven for me without delay“ , said the emperor. The crooks asked for gold and the finest silk and the most precious gold-cloth. the emperor gave them all they asked and told them to begin weaving the dress immediately. The emperor wanted to wear the new suit at the annual grand parade where everyone in the city would gather around to watch the emperor pass by. The crooks pretended to be hard at work and bought several candles to burn all night so that everyone will think they were working hard on the emperor’s new suit. The people fell for their trick and praised the weavers. The crooks did nothing all day but laugh at the foolishness of the emperor. Soon, the emperor wanted to see his new suit but the weavers told him that it was not ready to be seen yet. The emperor grew impatient and decided to send his old minsiter to spy on the weavers. The old minister was surprised to see that the weavers were not weaving any dress at all! The weavers pointed at empty looms and told him the colors and patterns on the dress but he could not see anythimg. The old minsiter was worried that he was unfit for his position and he did not want the emperor to know of this. He returned to the emperor and told him that his new suit was very beautiflu and colorful. The emperor was plaeased and appointed the crooks new imperial court weavers. The crooks laughed at the emperor’s foolishness for he did not know he was being tricked. The day of the parade came and the weavers brought an invisble suit to the empror. The emperor was worried because he could not see anything at all. The weavers wore him an invisible coat and trousers. The emperor did not want them to know that he was unfit for his position. He was worried about what the people would say. He pretended to wear this invisible suit and told the weavers that the new suit was very beautiful and colorful but in fact, ther was no coat or trouser. The emperor’s  chamberlains, who were to carry the train, stretched their hands to the ground and pretended to lift up a train, and hold something in their hands. They did not want the people to know that they could not see anything. The emperor marched in the procession under the beautiful canopy, and everyone started to laugh at him. “The emperor has nothing on at all,” cried the people. The emperor was sorry that he had been tricked and the people were right but there was nothing he could do. He continued to march and the chamberlains continued to walk, carrying a train that did not exist.",
    "summary": "A vain emperor hired two people to make him some new clothes. They tricked him, telling him the cloth was not visible to people unfit for his position or who were very stupid. At first, the people pretended to see the clothes, but a child says that he is not wearing clothes and people start to agree. The emperor realized he was swindled but continues the parade anyway."
  },
  {
    "title": "The Gingerbread Man",
    "text": "Once, there lived a little boy and his grandparents. One day, his grandmother decided to make a gingerbread man for the little boy. She mixed some eggs and some flour and made it into dough. Next, she rolled the dough flat and cut it into the shape of a gingerbread man. She made it two eyes with some grapes and gave it feet.  She made it two hands and the little boy cheered. She took some grapes and made them as buttons on his shirt. She added a collar and used up the rest of the dough to give a nose and a mouth. She then places the gingerbread man in the oven and leaves it to bake. The little boy sits in the kitchen to watch over the gingerbread man while his grandmother joins his grandfather in the garden. Soon, the little boy grew impatient and tired of waiting. He went out to join his grandparents in the garden. They were plucking out weed and trimming the plants. Just then, the little remembered the gingerbread man in the oven. He hurried back to the kitchen and saw that the gingerbread man was ready. He opened the oven and the gingerbread man jumped out. The little boy was amazed to see the gingerbread man alive. He tried to catch him but the gingerbread man was too fast. It leaped from the table and ran into the garden. As he ran, the Gingerbread Man cried “Run! Run! As fast as you can! But you cannot catch me. I am the Gingerbread Man!” The little boy ran after the ginerbread man and called for help. His grandparents saw him run after the creature and joined him in the chase so all three began to chase the gingerbread man. The gingerbread man ran into the woods and past a spotted dog. The spotted dog barks and runs after the gingerbread man too. Now, the little boy, his grandparents and the spotted dog ran after the gingerbread man. The gingerbread man cried out again “Run! Run! As fast as you can! But you cannot catch me. I am the Gingerbread Man!” He ran past a hungry crow and it chases after the gingerbread man. Now, the little boy, his grandparents, the spotted dog and the hungry crow ran after the gingerbread man. The gingerbread man cried out again “Run! Run! As fast as you can! But you cannot catch me. I am the Gingerbread Man!” He ran past three mowers who were busy cutting grass. When they saw the Gingerbread Man, they stopped working, and wanted to eat him. They ran after the Gingerbread Man also. Now, the little boy, his grandparents, the spotted dog, the hungry crow and the three mowers ran after the gingerbread man. The gingerbread man cried out again “Run! Run! As fast as you can! But you cannot catch me. I am the Gingerbread Man!” The gingerbread man continued to run until it reached a river bank. He could not swim so he needed help to cross the river. Suddenly, a cunning fox came out of the woods and asked the gingerbread man to climb onto his back. The gingerbread man did not know that the fox wanted to eat him. The fox started to swim. The fox told the gingerbread man that the water is too deep and asked him to hop onto his nose. The gingerbread man hopped onto the fox’s nose and the fox grinned. Now, the gingerbread man was close to his mouth. Immediately, the fox tossed him up into the air, opened his mouth and gobbled up the Gingerbread Man. That was the end of the Gingerbread Man. Everyone was sad and disappointed that they could not eat the gingerbread man but grandmother told them she will make another one. Everyone was looking forward to the next Gingerbread Man that the old lady was planning to bake." ,
    "summary": "A little old woman baked a gingerbread man, and when she took him out of the oven, he ran away. The woman, her husband and some of their animals chased him. No one could catch him. He came to a river and a sly fox told him he could jump on his tail and he would take him across. He did and the fox went deeper and the gingerbread man had to jump on his back and then on his nose. When he got to his nose, the fox ate him."
  }
]