[
  {
    "title": "Hansel and Gretel",
    "text": "Once upon a time, a brother and sister named Hansel and Gretel lived in a hut in the woods with their father who was a poor woodcutter and their mother. Their parents were very poor and had barely enough food to eat One day, their parents sent them off into the woods in search of greener pastures. Their mother cried as she sent them off but they could not take care of them any longer. Hansel and Gretel took a few pebbles and some bread crumbs with them. That night the two children had nowhere to sleep. They wandered in the forest for days, looking for food and a place to stay. The children slept under a tree that night and kept each other warm. The next morning when the sun rose, Hansel turned to his little sister. “Gretel,” he said, “we cannot stay here.  We must go deeper into the woods!  Surely we will find more to eat than what we get at home and we can bring some food for mother and father” Gretel was worried. “But what if we get lost?” she asked “We won’t!” said Hansel.  “If we get lost, we will follow the pebbles back home.” As they went deeper and deeper into the forest, the children decided to drop pebbles on the path to help them find a way back home if they get lost. Soon, they had no more pebbles and all they had left were bread crumbs.  Gretel was careful to drop one crumb and then after a bit, another. There was no luck and the children had looked and looked for any sign of something to eat – an apple tree, pear tree, some nuts on the ground, or even dried-up berries.  There was nothing to eat!  They got hungrier and hungrier and the children were tired. They decided to go back home or they would starve. They turned back and all the bread crumbs were gone. Now they were lost! They did not know their way back home. “Oh, no!” cried Gretel “The birds ate up all the crumbs!” the children were sad. Gretel began to cry but Hansel assured her they will be safe. They walked on and suddenly, a wolf howled in the distance. They hurried away to avoid being eaten by the wolf. The sun was setting and the children were lost and hungry.  Now they were scared, too. Soon, they saw a strange house made up of cookies, candies, and chocolates. The children were immediately happy and ran along the path to the house. They knocked at the yummy chocolate door but nobody answered. They knocked again and the door opened. The children were too hungry to wait for the owner of the house. They went in and started to eat the yummy door. When they both were eating the yummy door, a witch pounced on them. The strange house belonged to a witch! The children begged for their lives but the evil witch did not listen. She locked up Hansel in a cage and asked Gretel to help her heat the oven. She would cook them and eat them up. But just as the witch bent to check the oven’s temperature, Gretel pushed her from behind and locked the oven door. Gretel rescued Hansel and they filled their pockets with the witch’s jewels and goodies. They ran as fast as they could through the forest without stopping. They were too scared to stop for the witch may catch up to them. Finally, they managed to find their way back home and gave jewels to their parents. Thanks to the clever children! The family was never poor and hungry again."
  },
  {
    "title": "The Three Little Pigs",
    "text": "Once upon a time, there was a farmer with three little pigs. He did not have enough food to take care of his pigs so he sent them away to take care of themselves. The first little pig was walking on the road. Suddenly he saw a man with some straws. He could  build a house with the straws, he said to himself and asked the man to give him his straws. The man was kind so he gave the first little pig his straws. The pig used the straws to build a straw house and danced around. Suddenly, a big bad wolf knocked on the door. “Little pig, little pig, let me come in.” The big bad wolf said “No! Go away big bad wolf”, the little pig said “Then I’ll puff, and I’ll huff, and I’ll blow your house in.“, the big bad wolf said So he huffed, and puffed, and he blew the house down. The big bad wolf ate up the little pig. The second little pig saw a man with some mud. He coud build a house with the mud, he said to himself and asked the man to give him his mud. The man was also kind so he gave the second little pig his mud. The pig used the mud to build a mud house and danced around. Suddenly, a big bad wolf knocked on the door. “Little pig, little pig, let me come in.” The big bad wolf said “No! Go away big bad wolf”, the little pig said “Then I’ll puff, and I’ll huff, and I’ll blow your house in.“, the big bad wolf said So he huffed, and puffed, and huffed and puffed and huffed and puffed once more then he blew the house down. The big bad wolf ate up the second little pig. The third little pig saw a man with some red bricks. He could build a house with the red bricks, he said to himself and asked the man to give him his red bricks. The man was kind too so he gave the third little pig his straws. The pig used the straws to build a straw house and danced around. Suddenly, a big bad wolf knocked on the door. “Little pig, little pig, let me come in.” The big bad wolf said “No! Go away big bad wolf”, the little pig said “Then I’ll puff, and I’ll huff, and I’ll blow your house in.“, the big bad wolf said So he huffed, and puffed, and huffed and puffed, and huffed and puffed and huffed and puffed once more but he could not blow down the house. The red brick was very strong. The third little pig was very happy that the wolf could not blow down his house. The wolf was very angry. He had a new plan. He will trick the little pig so that it will step out of the house and he will eat the little pig. “Little pig, I know where there are nice apples” “Where?” asked the little pig. “They are in the fields up the hill. If you will, we will go together tomorrow and get some for dinner.” “Okay,” said the little pig, “I will be ready. What time are we going?”, asked the little pig. “At six o‘clock”, said the big bad wolf. The next day, the pig woke up very early and went to fetch the apples before the big bad wolf arrived. “Little pig, are you ready?”, the big bad wolf asked.  I have gone and come back, and got a nice potful for dinner.”, said the little pig. The wolf felt very angry at this. The little pig was very smart. He decided to climb up the chimney but the little pig was very smart indeed. He placed a big pot of boiling water at the bottom of the chimney. When the big bad wolf climbed down, he fell into the pot of boiling water. The little pig cheered. Now, the  big bad wolf was no more."
  },
  {
    "title": "Red Riding Hood",
    "text": "Once upon a time, there was a little girl who lived with her mother very close to the woods. The little girl was called Little Red Riding Hood because of the red hat her grandmother gifted her. She liked this hat very much and wore it everywhere. Her mother told her not to talk to strangers and she did as told. Whenever she was sent on an errand, she would be careful not to talk to strangers. One day, her grandmother was very sick so her mother sent her to deliver a basket of fruits and medicine to her grandmother who lived deep in the woods so she could feel better. Her mother instructed her to stay on the path and keep away from strangers. Little Red Riding Hood hurried off into the woods, singing as she strolled to her grandmother’s house. On the way, a hungry bad wolf spotted Little Red Riding Hood and began to salivate. He had seen his lunch. Fairy Tale Picture Little Red Riding Hood Little Red Riding Hood, depositephotos.com He approached her and Little Red Riding Hood forget her mother’s instruction. The wolf asked where she was off to in such a hurry. I am going to my grandmother’s house in the woods. She is very ill and needs some fruits and medicine to feel better“, replied Little Red Riding Hood. The bad wolf grinned to himself. Now, he had two lunches. He would eat the little girl and her grandmother. Little Red Riding Hood did not know the bad wolf’s evil plan. The bad wolf told Little Red Riding Hood that she should take along some flowers for her grandmother too. He said the flowers will make her feel better too. The little girl was thrilled and ran off to fetch some flowers for granmother. The wolf hurried off and went to grandmother’s house. He pretended to be Little Red Riding Hood. He knocked on the door and waited for a response. “Who is at the door?“grandmother asked. “Grandmother, it is I, little red rding hood“, the wolf replied “Oh, dear. Come on in. Remove the latch and enter“, said grandmother. She did not know that it was the bad wolf. The bad wolf entered and went straight up to grandmother’s room. She was laying on her bed. The wolf pounced on her and ate her up. The bad wolf then wore grandmother’s clothes and pretended to be grandmother. He tucked himslef into grandmother’s bed and waited for Little Red Riding Hood. Soon after picking flowers, Little Red Riding Hood ran off to grandmother’s house. She saw the door opened and called out to grandmother but there was no response. She was worried for grandmother and hurriedly ran inside. “Grandmother!“, she called out repeatedly but there was no response still. When she reached grandmother’s room, she saw grandmother asleep on the bed. Grandmother looked very different. She had big ears, huge teeth, huge feet and hands and she was very big. She did not know that it was the bad wolf. Suddenly, the bad wolf jumpd out of bed and ate her up. The bad wolf was no longer hnugry. He decided to take a nap after a very satisfying lunch. Soon, a hunter passed by grandmother’s house. He knew grandmother very well and was surprised to see her door opened. “Grandmother“, he called out but there was no response. He entered and went up to grandmother’s room. He was surpeised to see the bad wolf he had been looking for in grandmother’s bed. He must have ate up grandmother, he thought. He opened up the bad wolf and found grandmother and Little Red Riding Hood in the wolf’s belly. The bad wolf was afraid and ran off.  Little Red Riding Hood gave grandmother her fruit and medicine and they were happy. No one knew what became of the bad wolf but no one heard about him again"
  }
]