{
    "title":"Red Riding Hood", 
    "text": "Once upon a time, there was a little girl who lived with her mother very close to the woods. The little girl was called Little Red Riding Hood because of the red hat her grandmother gifted her. She liked this hat very much and wore it everywhere. Her mother told her not to talk to strangers and she did as told. Whenever she was sent on an errand, she would be careful not to talk to strangers. One day, her grandmother was very sick so her mother sent her to deliver a basket of fruits and medicine to her grandmother who lived deep in the woods so she could feel better. Her mother instructed her to stay on the path and keep away from strangers. Little Red Riding Hood hurried off into the woods, singing as she strolled to her grandmother’s house. On the way, a hungry bad wolf spotted Little Red Riding Hood and began to salivate. He had seen his lunch. Fairy Tale Picture Little Red Riding Hood Little Red Riding Hood, depositephotos.com He approached her and Little Red Riding Hood forget her mother’s instruction. The wolf asked where she was off to in such a hurry. I am going to my grandmother’s house in the woods. She is very ill and needs some fruits and medicine to feel better“, replied Little Red Riding Hood. The bad wolf grinned to himself. Now, he had two lunches. He would eat the little girl and her grandmother. Little Red Riding Hood did not know the bad wolf’s evil plan. The bad wolf told Little Red Riding Hood that she should take along some flowers for her grandmother too. He said the flowers will make her feel better too. The little girl was thrilled and ran off to fetch some flowers for granmother. The wolf hurried off and went to grandmother’s house. He pretended to be Little Red Riding Hood. He knocked on the door and waited for a response. “Who is at the door?“grandmother asked. “Grandmother, it is I, little red rding hood“, the wolf replied “Oh, dear. Come on in. Remove the latch and enter“, said grandmother. She did not know that it was the bad wolf. The bad wolf entered and went straight up to grandmother’s room. She was laying on her bed. The wolf pounced on her and ate her up. The bad wolf then wore grandmother’s clothes and pretended to be grandmother. He tucked himslef into grandmother’s bed and waited for Little Red Riding Hood. Soon after picking flowers, Little Red Riding Hood ran off to grandmother’s house. She saw the door opened and called out to grandmother but there was no response. She was worried for grandmother and hurriedly ran inside. “Grandmother!“, she called out repeatedly but there was no response still. When she reached grandmother’s room, she saw grandmother asleep on the bed. Grandmother looked very different. She had big ears, huge teeth, huge feet and hands and she was very big. She did not know that it was the bad wolf. Suddenly, the bad wolf jumpd out of bed and ate her up. The bad wolf was no longer hnugry. He decided to take a nap after a very satisfying lunch. Soon, a hunter passed by grandmother’s house. He knew grandmother very well and was surprised to see her door opened. “Grandmother“, he called out but there was no response. He entered and went up to grandmother’s room. He was surpeised to see the bad wolf he had been looking for in grandmother’s bed. He must have ate up grandmother, he thought. He opened up the bad wolf and found grandmother and Little Red Riding Hood in the wolf’s belly. The bad wolf was afraid and ran off.  Little Red Riding Hood gave grandmother her fruit and medicine and they were happy. No one knew what became of the bad wolf but no one heard about him again"
}