{
    "title":"The Three Little Pigs", 
    "text":"Once upon a time, there was a farmer with three little pigs. He did not have enough food to take care of his pigs so he sent them away to take care of themselves. The first little pig was walking on the road. Suddenly he saw a man with some straws. He could  build a house with the straws, he said to himself and asked the man to give him his straws. The man was kind so he gave the first little pig his straws. The pig used the straws to build a straw house and danced around. Suddenly, a big bad wolf knocked on the door. “Little pig, little pig, let me come in.” The big bad wolf said “No! Go away big bad wolf”, the little pig said “Then I’ll puff, and I’ll huff, and I’ll blow your house in.“, the big bad wolf said So he huffed, and puffed, and he blew the house down. The big bad wolf ate up the little pig. The second little pig saw a man with some mud. He coud build a house with the mud, he said to himself and asked the man to give him his mud. The man was also kind so he gave the second little pig his mud. The pig used the mud to build a mud house and danced around. Suddenly, a big bad wolf knocked on the door. “Little pig, little pig, let me come in.” The big bad wolf said “No! Go away big bad wolf”, the little pig said “Then I’ll puff, and I’ll huff, and I’ll blow your house in.“, the big bad wolf said So he huffed, and puffed, and huffed and puffed and huffed and puffed once more then he blew the house down. The big bad wolf ate up the second little pig. The third little pig saw a man with some red bricks. He could build a house with the red bricks, he said to himself and asked the man to give him his red bricks. The man was kind too so he gave the third little pig his straws. The pig used the straws to build a straw house and danced around. Suddenly, a big bad wolf knocked on the door. “Little pig, little pig, let me come in.” The big bad wolf said “No! Go away big bad wolf”, the little pig said “Then I’ll puff, and I’ll huff, and I’ll blow your house in.“, the big bad wolf said So he huffed, and puffed, and huffed and puffed, and huffed and puffed and huffed and puffed once more but he could not blow down the house. The red brick was very strong. The third little pig was very happy that the wolf could not blow down his house. The wolf was very angry. He had a new plan. He will trick the little pig so that it will step out of the house and he will eat the little pig. “Little pig, I know where there are nice apples” “Where?” asked the little pig. “They are in the fields up the hill. If you will, we will go together tomorrow and get some for dinner.” “Okay,” said the little pig, “I will be ready. What time are we going?”, asked the little pig. “At six o‘clock”, said the big bad wolf. The next day, the pig woke up very early and went to fetch the apples before the big bad wolf arrived. “Little pig, are you ready?”, the big bad wolf asked.  I have gone and come back, and got a nice potful for dinner.”, said the little pig. The wolf felt very angry at this. The little pig was very smart. He decided to climb up the chimney but the little pig was very smart indeed. He placed a big pot of boiling water at the bottom of the chimney. When the big bad wolf climbed down, he fell into the pot of boiling water. The little pig cheered. Now, the  big bad wolf was no more." 
}